Teejer/zxh-bms-zigbee/sdkconfig.defaults
# ESP32-C6 (RISC-V, native IEEE 802.15.4 radio)
CONFIG_IDF_TARGET="esp32c6"

# --- Zigbee (esp-zigbee-lib v2) -------------------------------------------
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ZCZR=y
CONFIG_ZB_RADIO_NATIVE=y

# --- Bluetooth LE only: the battery side stays BLE, classic BT is unused ---
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=n
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_GATTC_ENABLE=y
CONFIG_BT_BLE_BLUFI_ENABLE=n

# BLE + 802.15.4 share one 2.4 GHz radio on the C6; the software coexistence
# scheduler arbitrates between the BLE poll bursts and Zigbee traffic.
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
CONFIG_ESP_COEX_GPIO_DEBUG=n

# --- Flash / partitions -----------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Logging ----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- Main task headroom (NimBLE/Bluedroid + Zigbee init) --------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
